package demo04_Sort;

/**
 * &#064;BelongsProject: algorithm
 * &#064;CreateTime: 2023-10-17  19:57
 * &#064;Description: TODO
 * &#064;Author: lanai
 */
public class demo04_Radix_Counting_bucket_sort {

    /*
     基数排序：
        非比较性排序算法，适用于排序多位数值的数据，如整数或字符串。
        它的核心思想是根据元素的位数，将待排序的元素分配到不同的桶中，然后依次对每个位数上的桶进行排序。
        这个过程重复进行，直到所有位数都被考虑完，最终获得排序后的结果。
     计数排序:
        适用于对非负整数进行排序。
        它的基本思想是首先确定待排序序列中元素的范围，然后创建一个计数数组，用于统计每个元素在待排序序列中出现的次数。
        接下来，根据计数数组的信息，将元素按顺序排列，从而得到排序后的序列。
     桶排序：
        非比较排序算法，适用于排序一定范围内的浮点数或整数。
        它的核心思想是将待排序元素分散到不同的桶中，然后对每个桶中的元素进行排序。
        最终，将所有桶的内容按顺序合并以获得完全有序的结果。

     */

    public static void main(String[] args) {

    }
}
